/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   akkerman_func.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: agottlie <agottlie@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/12/23 14:53:56 by agottlie          #+#    #+#             */
/*   Updated: 2018/12/24 13:52:02 by agottlie         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

// first solution
long	ft_akkerman(int m, int n)
{
	if (m == 0)
		return (n + 1);
	else if (m > 0 && n == 0)
		return (ft_akkerman(m - 1, 1));
	else						// if (m > 0 $$ n > 0)
		return (ft_akkerman(m - 1, ft_akkerman(m, n - 1)));
	return (0);
}

int		main()
{
	printf("%ld\n", ft_akkerman(3, 5));
	return 0;
}

// Функция Аккермана
// В теории вычислимости важную роль играет функция Аккермана A(m,n), определенная следующим образом:
// Даны два целых неотрицательных числа m и n, каждое в отдельной строке. Выведите A(m,n)