/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   num_reverse.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: agottlie <agottlie@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/01/06 08:16:16 by agottlie          #+#    #+#             */
/*   Updated: 2019/01/06 08:33:26 by agottlie         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int		ft_num_reverse(int num)
{
	if (num > 0)
	{
		printf("%d ", num % 10);
		return (ft_num_reverse(num / 10));
	}
	return (0);
}

int		main()
{
	int		step;
	int		i;

	step = 136;
	i = 10;
	while (i < 1235)
	{
		ft_num_reverse(i);
		printf("=== %d\n", i);
		i += step;
	}
	return 0;
}

// Цифры числа справа налево
// Дано натуральное число N. Выведите все его цифры по одной, в обратном порядке, разделяя их пробелами или новыми строками.
// При решении этой задачи нельзя использовать строки, списки, массивы (ну и циклы, разумеется). Разрешена только рекурсия и целочисленная арифметика.