/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   pow_of_2.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: agottlie <agottlie@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/01/05 16:00:06 by agottlie          #+#    #+#             */
/*   Updated: 2019/01/06 08:33:33 by agottlie         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

void	ft_pow_of_2(int n)
{
	if (n % 2 == 0 && n > 0)
		ft_pow_of_2(n / 2);
	else if (n == 1)
	{
		printf("YEEEES\n");
		return ;
	}
	else
		printf("NO\n");
}

int		main()
{
	int		i;

	i = 0;
	while (i <= 64)
	{
		printf("%d === ", i);
		ft_pow_of_2(i);
		++i;
	}
	return 0;
}

// Точная степень двойки
// Дано натуральное число N. Выведите слово YES, если число N является точной степенью двойки, или слово NO в противном случае.
// Операцией возведения в степень пользоваться нельзя!